HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxPort_bf.h
/** \brief Offset for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_OFF (5u)

/** \brief Length for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_OFF (6u)

/** \brief Length for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_OFF (7u)

/** \brief Length for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_OFF (8u)

/** \brief Length for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_OFF (9u)

/** \brief Length for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_OFF (10u)

/** \brief Length for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_OFF (11u)

/** \brief Length for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_OFF (12u)

/** \brief Length for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_OFF (13u)

/** \brief Length for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_OFF (14u)

/** \brief Length for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_OFF (15u)

/** \brief Length for Ifx_P_OMR_Bits.PCL0 */
#define IFX_P_OMR_PCL0_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL0 */
#define IFX_P_OMR_PCL0_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL0 */
#define IFX_P_OMR_PCL0_OFF (16u)

/** \brief Length for Ifx_P_OMR_Bits.PCL1 */
#define IFX_P_OMR_PCL1_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL1 */
#define IFX_P_OMR_PCL1_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL1 */
#define IFX_P_OMR_PCL1_OFF (17u)

/** \brief Length for Ifx_P_OMR_Bits.PCL2 */
#define IFX_P_OMR_PCL2_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL2 */
#define IFX_P_OMR_PCL2_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL2 */
#define IFX_P_OMR_PCL2_OFF (18u)

/** \brief Length for Ifx_P_OMR_Bits.PCL3 */
#define IFX_P_OMR_PCL3_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL3 */
#define IFX_P_OMR_PCL3_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL3 */
#define IFX_P_OMR_PCL3_OFF (19u)

/** \brief Length for Ifx_P_OMR_Bits.PCL4 */
#define IFX_P_OMR_PCL4_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL4 */
#define IFX_P_OMR_PCL4_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL4 */
#define IFX_P_OMR_PCL4_OFF (20u)

/** \brief Length for Ifx_P_OMR_Bits.PCL5 */
#define IFX_P_OMR_PCL5_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL5 */
#define IFX_P_OMR_PCL5_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL5 */
#define IFX_P_OMR_PCL5_OFF (21u)

/** \brief Length for Ifx_P_OMR_Bits.PCL6 */
#define IFX_P_OMR_PCL6_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL6 */
#define IFX_P_OMR_PCL6_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL6 */
#define IFX_P_OMR_PCL6_OFF (22u)

/** \brief Length for Ifx_P_OMR_Bits.PCL7 */
#define IFX_P_OMR_PCL7_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL7 */
#define IFX_P_OMR_PCL7_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL7 */
#define IFX_P_OMR_PCL7_OFF (23u)

/** \brief Length for Ifx_P_OMR_Bits.PCL8 */
#define IFX_P_OMR_PCL8_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL8 */
#define IFX_P_OMR_PCL8_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL8 */
#define IFX_P_OMR_PCL8_OFF (24u)

/** \brief Length for Ifx_P_OMR_Bits.PCL9 */
#define IFX_P_OMR_PCL9_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL9 */
#define IFX_P_OMR_PCL9_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL9 */
#define IFX_P_OMR_PCL9_OFF (25u)

/** \brief Length for Ifx_P_OMR_Bits.PCL10 */
#define IFX_P_OMR_PCL10_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL10 */
#define IFX_P_OMR_PCL10_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL10 */
#define IFX_P_OMR_PCL10_OFF (26u)

/** \brief Length for Ifx_P_OMR_Bits.PCL11 */
#define IFX_P_OMR_PCL11_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL11 */
#define IFX_P_OMR_PCL11_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL11 */
#define IFX_P_OMR_PCL11_OFF (27u)

/** \brief Length for Ifx_P_OMR_Bits.PCL12 */
#define IFX_P_OMR_PCL12_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL12 */
#define IFX_P_OMR_PCL12_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL12 */
#define IFX_P_OMR_PCL12_OFF (28u)

/** \brief Length for Ifx_P_OMR_Bits.PCL13 */
#define IFX_P_OMR_PCL13_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL13 */
#define IFX_P_OMR_PCL13_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL13 */
#define IFX_P_OMR_PCL13_OFF (29u)

/** \brief Length for Ifx_P_OMR_Bits.PCL14 */
#define IFX_P_OMR_PCL14_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL14 */
#define IFX_P_OMR_PCL14_MSK (0x1u)

/** \brief Offset for Ifx_P_OMR_Bits.PCL14 */
#define IFX_P_OMR_PCL14_OFF (30u)

/** \brief Length for Ifx_P_OMR_Bits.PCL15 */
#define IFX_P_OMR_PCL15_LEN (1u)

/** \brief Mask for Ifx_P_OMR_Bits.PCL15 */
#define IFX_P_OMR_PCL15_MSK (0x1u)

