HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxPort_bf.h
/** \brief Mask for Ifx_P_OMSR_Bits.PS8 */
#define IFX_P_OMSR_PS8_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS8 */
#define IFX_P_OMSR_PS8_OFF (8u)

/** \brief Length for Ifx_P_OMSR_Bits.PS9 */
#define IFX_P_OMSR_PS9_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS9 */
#define IFX_P_OMSR_PS9_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS9 */
#define IFX_P_OMSR_PS9_OFF (9u)

/** \brief Length for Ifx_P_OMSR_Bits.PS10 */
#define IFX_P_OMSR_PS10_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS10 */
#define IFX_P_OMSR_PS10_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS10 */
#define IFX_P_OMSR_PS10_OFF (10u)

/** \brief Length for Ifx_P_OMSR_Bits.PS11 */
#define IFX_P_OMSR_PS11_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS11 */
#define IFX_P_OMSR_PS11_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS11 */
#define IFX_P_OMSR_PS11_OFF (11u)

/** \brief Length for Ifx_P_OMSR_Bits.PS12 */
#define IFX_P_OMSR_PS12_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS12 */
#define IFX_P_OMSR_PS12_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS12 */
#define IFX_P_OMSR_PS12_OFF (12u)

/** \brief Length for Ifx_P_OMSR_Bits.PS13 */
#define IFX_P_OMSR_PS13_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS13 */
#define IFX_P_OMSR_PS13_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS13 */
#define IFX_P_OMSR_PS13_OFF (13u)

/** \brief Length for Ifx_P_OMSR_Bits.PS14 */
#define IFX_P_OMSR_PS14_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS14 */
#define IFX_P_OMSR_PS14_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS14 */
#define IFX_P_OMSR_PS14_OFF (14u)

/** \brief Length for Ifx_P_OMSR_Bits.PS15 */
#define IFX_P_OMSR_PS15_LEN (1u)

/** \brief Mask for Ifx_P_OMSR_Bits.PS15 */
#define IFX_P_OMSR_PS15_MSK (0x1u)

/** \brief Offset for Ifx_P_OMSR_Bits.PS15 */
#define IFX_P_OMSR_PS15_OFF (15u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL0 */
#define IFX_P_OMCR_PCL0_OFF (16u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL1 */
#define IFX_P_OMCR_PCL1_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL1 */
#define IFX_P_OMCR_PCL1_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL1 */
#define IFX_P_OMCR_PCL1_OFF (17u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL2 */
#define IFX_P_OMCR_PCL2_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL2 */
#define IFX_P_OMCR_PCL2_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL2 */
#define IFX_P_OMCR_PCL2_OFF (18u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL3 */
#define IFX_P_OMCR_PCL3_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL3 */
#define IFX_P_OMCR_PCL3_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL3 */
#define IFX_P_OMCR_PCL3_OFF (19u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL4 */
#define IFX_P_OMCR_PCL4_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL4 */
#define IFX_P_OMCR_PCL4_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL4 */
#define IFX_P_OMCR_PCL4_OFF (20u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL5 */
#define IFX_P_OMCR_PCL5_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL5 */
#define IFX_P_OMCR_PCL5_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL5 */
#define IFX_P_OMCR_PCL5_OFF (21u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL6 */
#define IFX_P_OMCR_PCL6_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL6 */
#define IFX_P_OMCR_PCL6_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL6 */
#define IFX_P_OMCR_PCL6_OFF (22u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL7 */
#define IFX_P_OMCR_PCL7_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL7 */
#define IFX_P_OMCR_PCL7_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL7 */
#define IFX_P_OMCR_PCL7_OFF (23u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL8 */
#define IFX_P_OMCR_PCL8_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL8 */
#define IFX_P_OMCR_PCL8_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL8 */
#define IFX_P_OMCR_PCL8_OFF (24u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL9 */
#define IFX_P_OMCR_PCL9_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL9 */
#define IFX_P_OMCR_PCL9_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL9 */
#define IFX_P_OMCR_PCL9_OFF (25u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL10 */
#define IFX_P_OMCR_PCL10_OFF (26u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL11 */
#define IFX_P_OMCR_PCL11_OFF (27u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL12 */
#define IFX_P_OMCR_PCL12_OFF (28u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL13 */
#define IFX_P_OMCR_PCL13_OFF (29u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL14 */
#define IFX_P_OMCR_PCL14_OFF (30u)

/** \brief Length for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_LEN (1u)

/** \brief Mask for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_MSK (0x1u)

/** \brief Offset for Ifx_P_OMCR_Bits.PCL15 */
#define IFX_P_OMCR_PCL15_OFF (31u)

/** \brief Length for Ifx_P_LPCR_Bits.REN_CTRL */
#define IFX_P_LPCR_REN_CTRL_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.REN_CTRL */
#define IFX_P_LPCR_REN_CTRL_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.REN_CTRL */
#define IFX_P_LPCR_REN_CTRL_OFF (0u)

/** \brief Length for Ifx_P_LPCR_Bits.RX_EN */
#define IFX_P_LPCR_RX_EN_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.RX_EN */
#define IFX_P_LPCR_RX_EN_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.RX_EN */
#define IFX_P_LPCR_RX_EN_OFF (1u)

/** \brief Length for Ifx_P_LPCR_Bits.TERM */
#define IFX_P_LPCR_TERM_LEN (1u)

/** \brief Mask for Ifx_P_LPCR_Bits.TERM */
#define IFX_P_LPCR_TERM_MSK (0x1u)

/** \brief Offset for Ifx_P_LPCR_Bits.TERM */
#define IFX_P_LPCR_TERM_OFF (2u)

/** \brief Length for Ifx_P_LPCR_Bits.LRXTERM */
#define IFX_P_LPCR_LRXTERM_LEN (3u)

/** \brief Mask for Ifx_P_LPCR_Bits.LRXTERM */
#define IFX_P_LPCR_LRXTERM_MSK (0x7u)

